fonecmid-diplom/src/DataProcessors/МассовоеСозданиеАктов/МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>ВКМ_Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// По умолчанию – текущий месяц.
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Объект.Период = Новый СтандартныйПериод(
			НачалоМесяца(ТекущаяДатаСеанса()),
			КонецМесяца(ТекущаяДатаСеанса()));
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	
	ОчиститьСообщения();
	ЗаполнитьНаСервере();
	
КонецПроцедуры
&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	ОчиститьСообщения();
	СоздатьРеализацииНаСервере();
	
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
// Заполнение списка договоров (длительная операция).
&НаКлиенте
Процедура ЗаполнитьНаСервере()
	
	ДлительнаяОперация = ВКМ_ЗапуститьЗаполнениеВФоне();
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ВыводитьОкноОжидания = Истина;
	НастройкиОжидания.ТекстСообщения = НСтр("ru = 'Заполнение списка договоров...'");
	
	Оповещение = Новый ОписаниеОповещения("ВКМ_ПослеЗаполнения", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, НастройкиОжидания);
	
КонецПроцедуры
&НаСервере
Функция ВКМ_ЗапуститьЗаполнениеВФоне()
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("Период", Объект.Период);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Массовое создание актов: заполнение договоров'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.МассовоеСозданиеАктов.ВКМ_ЗаполнитьТабличнуюЧастьВФоне",
		ПараметрыВызова,
		ПараметрыВыполнения);
	
КонецФункции
&НаКлиенте
Процедура ВКМ_ПослеЗаполнения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ВКМ_ЗагрузитьТабличнуюЧастьИзРезультата(Результат.АдресРезультата);
	
КонецПроцедуры
&НаСервере
Процедура ВКМ_ЗагрузитьТабличнуюЧастьИзРезультата(АдресРезультата)
	
	ДанныеТабличнойЧасти = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Объект.Договоры.Очистить();
	Для Каждого СтрокаДанных Из ДанныеТабличнойЧасти Цикл
		НоваяСтрока = Объект.Договоры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
	КонецЦикла;
	
КонецПроцедуры
// Создание реализаций (длительная операция).
&НаКлиенте
Процедура СоздатьРеализацииНаСервере()
	
	Если Объект.Договоры.Количество() = 0 Тогда
    Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "Сначала заполните список договоров";
Сообщение.Сообщить();
    
    Возврат;
КонецЕсли;
	
	ДлительнаяОперация = ВКМ_ЗапуститьСозданиеВФоне();
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ВыводитьОкноОжидания = Истина;
	НастройкиОжидания.ТекстСообщения = НСтр("ru = 'Создание реализаций...'");
	
	Оповещение = Новый ОписаниеОповещения("ВКМ_ПослеСозданияРеализаций", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, НастройкиОжидания);
	
КонецПроцедуры
&НаСервере
Функция ВКМ_ЗапуститьСозданиеВФоне()
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("Период", Объект.Период);
	ПараметрыВызова.Вставить("Договоры", Объект.Договоры.Выгрузить());
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Массовое создание актов: создание реализаций'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.МассовоеСозданиеАктов.ВКМ_СоздатьРеализацииВФоне",
		ПараметрыВызова,
		ПараметрыВыполнения);
	
КонецФункции
&НаКлиенте
Процедура ВКМ_ПослеСозданияРеализаций(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ВКМ_ЗагрузитьТабличнуюЧастьИзРезультата(Результат.АдресРезультата);
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Создание реализаций завершено.'"));
	
КонецПроцедуры
#КонецОбласти
